app/controllers/api/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all.reverse

INSERT INTO "posts" ("post_type", "title", "body", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "quote", "commentary", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
	def create
		@post = Post.new(post_params)
    @post.user_id = current_user.id
		if @post.save