app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "elizahamilton"], ["password_digest", "$2a$10$wjqEBsUEouLwUNYZdqlCXuSbd/2z.Km9jf3.7BCJWTIkK/meobaqe"], ["session_token", "8bgwIud7WrWfevaF682GjA=="]]
---
  def create
		@user = User.new(user_params)
    @user.avatar ||= "http://unblurapp.com/profs/images/default.jpg"
    @user.seed ||= false
		if @user.save